<a href="https://colab.research.google.com/github/Praxis-QR/RDWH/blob/main/Views_Virtual_Tables_Local_Shell_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


![alt text](https://4.bp.blogspot.com/-gbL5nZDkpFQ/XScFYwoTEII/AAAAAAAAAGY/CcVb_HDLwvs2Brv5T4vSsUcz7O4r2Q79ACK4BGAYYCw/s1600/kk3-header00-beta.png)<br>


<hr>

[Prithwis Mukerjee](http://www.linkedin.com/in/prithwis)<br>

#Install MySQL

In [1]:
!apt-get update > null
!apt-get -y install mysql-server > null
!/etc/init.d/mysql restart
!mysql -e 'create database praxisDB'
!mysql -e 'show databases'

 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
No directory, logging in with HOME=/
   ...done.
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| praxisDB           |
| sys                |
+--------------------+

#Create Table & Load Data

### Test Data <br>

dept.csv https://drive.google.com/open?id=1rJu1oUgUsShEG9Hh8IG0-55tAisfYBCc

emp.csv https://drive.google.com/open?id=136ZpigRZKG3T-9wEBjD7r6P94y9gCWeU

In [2]:
# The CSV files are stored in the author's Google Drive
!gdown -q https://drive.google.com/uc?id=1rJu1oUgUsShEG9Hh8IG0-55tAisfYBCc
!gdown -q  https://drive.google.com/uc?id=136ZpigRZKG3T-9wEBjD7r6P94y9gCWeU

In [3]:
!ls

dept.csv  emp.csv  null  sample_data

In [4]:
!mysql praxisDB -e 'drop table if exists empl'
!mysql praxisDB -e 'create table if not exists empl (empid char(6),lastname varchar(20), firstname varchar(20), jobdesc varchar(10), joindate date, salary int, comm decimal(3,2), deptid char(2));'
!mysql praxisDB -e 'drop table if exists dept'
!mysql praxisDB -e 'create table if not exists dept (deptid char(2),deptname varchar(20), managerid char(6), location varchar(10));'

In [5]:
!mysql praxisDB -e 'desc empl'

+-----------+--------------+------+-----+---------+-------+
| Field     | Type         | Null | Key | Default | Extra |
+-----------+--------------+------+-----+---------+-------+
| empid     | char(6)      | YES  |     | NULL    |       |
| lastname  | varchar(20)  | YES  |     | NULL    |       |
| firstname | varchar(20)  | YES  |     | NULL    |       |
| jobdesc   | varchar(10)  | YES  |     | NULL    |       |
| joindate  | date         | YES  |     | NULL    |       |
| salary    | int(11)      | YES  |     | NULL    |       |
| comm      | decimal(3,2) | YES  |     | NULL    |       |
| deptid    | char(2)      | YES  |     | NULL    |       |
+-----------+--------------+------+-----+---------+-------+

In [6]:
!mysql praxisDB -e 'desc dept'

+-----------+-------------+------+-----+---------+-------+
| Field     | Type        | Null | Key | Default | Extra |
+-----------+-------------+------+-----+---------+-------+
| deptid    | char(2)     | YES  |     | NULL    |       |
| deptname  | varchar(20) | YES  |     | NULL    |       |
| managerid | char(6)     | YES  |     | NULL    |       |
| location  | varchar(10) | YES  |     | NULL    |       |
+-----------+-------------+------+-----+---------+-------+

In [7]:
#quick SQL reference https://gist.github.com/hofmannsven/9164408
!mysql praxisDB -e "LOAD DATA LOCAL INFILE 'emp.csv' INTO TABLE empl FIELDS TERMINATED BY ',' IGNORE 1 LINES;"

In [8]:
#!cat dept.csv
!mysql praxisDB -e "LOAD DATA LOCAL INFILE 'dept.csv' INTO TABLE dept FIELDS TERMINATED BY ',' LINES TERMINATED BY '\r\n'  IGNORE 1 LINES;"

#Retrieve Data

In [9]:
!mysql praxisDB -e 'select * from empl'

+--------+-------------+-----------+------------+------------+--------+------+--------+
| empid  | lastname    | firstname | jobdesc    | joindate   | salary | comm | deptid |
+--------+-------------+-----------+------------+------------+--------+------+--------+
| 742866 | Bacchan     | Amitabh   | Executive  | 2003-03-10 |  50000 | 0.10 | 10     |
| 349870 | Mukherjee   | Rani      | Manager    | 2005-05-04 |  25000 | 0.06 | 40     |
| 865477 | Dikshit     | Madhuri   | Clerk      | 2002-04-04 |  10000 | 0.02 | 20     |
| 239456 | Khan        | Shahrukh  | Manager    | 2004-01-03 |  30000 | 0.07 | 20     |
| 897889 | Sehwag      | Virender  | Cus_Rep    | 2005-01-02 |  15000 | 0.05 | 20     |
| 123980 | Dhoni       | Mahender  | Clerk      | 2004-10-09 |   9000 | 0.02 | 40     |
| 822134 | Dravid      | Rahul     | Sr Manager | 2000-06-04 |  40000 | 0.08 | 30     |
| 997445 | Dalmia      | Jagmohan  | Clerk      | 2001-07-01 |  12000 | 0.02 | 30     |
| 989007 | Ganguly     | Sourav    | Cus_Rep    | 2002-01-01 |  20000 | 0.03 | 40     |
| 299034 | Ganesan     | Rekha     | Director   | 2002-10-10 |  60000 | 0.11 | 10     |
| 546223 | Karthikeyan | Narayan   | Secretary  | 2005-12-04 |  40000 | 0.09 | 10     |
| 223112 | Mirza       | Sania     | Cus_Rep    | 2001-11-19 |  25000 | 0.04 | 30     |
+--------+-------------+-----------+------------+------------+--------+------+--------+

In [10]:
!mysql praxisDB -e 'select * from dept'

+--------+------------+-----------+----------+
| deptid | deptname   | managerid | location |
+--------+------------+-----------+----------+
| 10     | Corporate  | 299034    | Calcutta |
| 20     | Sales      | 239456    | Calcutta |
| 30     | Accounts   | 822134    | Calcutta |
| 40     | Production | 349870    | Bombay   |
+--------+------------+-----------+----------+

In [11]:
!mysql praxisDB -e 'select lastname, firstname, location from empl, dept where empl.deptid = dept.deptid'

+-------------+-----------+----------+
| lastname    | firstname | location |
+-------------+-----------+----------+
| Bacchan     | Amitabh   | Calcutta |
| Mukherjee   | Rani      | Bombay   |
| Dikshit     | Madhuri   | Calcutta |
| Khan        | Shahrukh  | Calcutta |
| Sehwag      | Virender  | Calcutta |
| Dhoni       | Mahender  | Bombay   |
| Dravid      | Rahul     | Calcutta |
| Dalmia      | Jagmohan  | Calcutta |
| Ganguly     | Sourav    | Bombay   |
| Ganesan     | Rekha     | Calcutta |
| Karthikeyan | Narayan   | Calcutta |
| Mirza       | Sania     | Calcutta |
+-------------+-----------+----------+

#Python with Pandas

## Panda Modules

In [12]:
!apt install libmysqlclient-dev > null
!pip -q install mysqlclient 
import pandas as pd
import MySQLdb

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

     |████████████████████████████████| 87 kB 2.9 MB/s
  Building wheel for mysqlclient (setup.py) ... done

In [13]:
DBConn = MySQLdb.connect(db='praxisDB') 
df_mysql = pd.read_sql('show tables', con=DBConn)    
print ('loaded dataframe from MySQL. records:', len(df_mysql))
DBConn.close()

loaded dataframe from MySQL. records: 2

In [14]:
df_mysql

  Tables_in_praxisDB
0               dept
1               empl

## Pandas Functions

In [16]:
#To run any non-SELECT SQL command
def runCMD (DDL):
    DBConn= MySQLdb.connect(db='praxisDB')      # hardcoded with dbname
    myCursor = DBConn.cursor()
    retcode = myCursor.execute(DDL) 
    print (retcode)
    DBConn.commit()
    DBConn.close()

#To run any SELECT SQL command
def runSELECT (CMD):
    DBConn= MySQLdb.connect(db='praxisDB')     # hardcoded with dbname
    df_mysql = pd.read_sql(CMD, con=DBConn)    
    DBConn.close()
    return df_mysql

#Views - Create

In [17]:
#runCMD("drop view v1_emp")
runCMD("create view v1_emp as select * from empl")

0

In [35]:
runSELECT("select * from v1_emp")

     empid     lastname firstname     jobdesc    joindate  salary  comm deptid
0   742866      Bacchan   Amitabh   Executive  2003-03-10   50000  0.10     10
1   349870    Mukherjee      Rani     Manager  2005-05-04   25000  0.06     40
2   865477      Dikshit   Madhuri       Clerk  2002-04-04   10000  0.02     20
3   239456         Khan   Farookh     Manager  2004-01-03   30000  0.07     20
4   897889       Sehwag  Virender     Cus_Rep  2005-01-02   15000  0.05     20
5   123980        Dhoni  Mahender       Clerk  2004-10-09    9000  0.02     40
6   822134       Dravid     Rahul  Sr Manager  2000-06-04   40000  0.08     30
7   997445       Dalmia  Jagmohan       Clerk  2001-07-01   12000  0.02     30
8   989007      Ganguly    Sourav     Cus_Rep  2002-01-01   20000  0.03     40
9   299034      Ganesan     Rekha    Director  2002-10-10   60000  0.11     10
10  546223  Karthikeyan   Narayan   Secretary  2005-12-04   40000  0.09     10
11  223112        Mirza     Sania     Cus_Rep  2001-11-19   25000  0.04     30

In [19]:
#runCMD("drop view v2_empclub")
runCMD("create view v2_empclub as select empid, firstname, lastname, deptid from empl")

0

In [36]:
runSELECT("select * from v2_empclub")

     empid firstname     lastname deptid
0   742866   Amitabh      Bacchan     10
1   349870      Rani    Mukherjee     40
2   865477   Madhuri      Dikshit     20
3   239456   Farookh         Khan     20
4   897889  Virender       Sehwag     20
5   123980  Mahender        Dhoni     40
6   822134     Rahul       Dravid     30
7   997445  Jagmohan       Dalmia     30
8   989007    Sourav      Ganguly     40
9   299034     Rekha      Ganesan     10
10  546223   Narayan  Karthikeyan     10
11  223112     Sania        Mirza     30

In [21]:
#runCMD("drop view v3_dept30")
runCMD("create view v3_dept30 as select empid, firstname, lastname, jobdesc from empl where deptid = '20'")

0

In [37]:
runSELECT("select * from v3_dept30")

    empid firstname lastname  jobdesc
0  865477   Madhuri  Dikshit    Clerk
1  239456   Farookh     Khan  Manager
2  897889  Virender   Sehwag  Cus_Rep

In [23]:
#runCMD("drop view v4_managers")
runCMD("create view v4_managers as select empid, firstname, lastname, jobdesc from empl where jobdesc like '%Manager%'")

0

In [38]:
runSELECT("select * from v4_managers")

    empid firstname   lastname     jobdesc
0  349870      Rani  Mukherjee     Manager
1  239456   Farookh       Khan     Manager
2  822134     Rahul     Dravid  Sr Manager

In [25]:
#runCMD("drop view v5_emplocation")
runCMD("create view v5_emplocation as select lastname, firstname, location from empl, dept where empl.deptid = dept.deptid")

0

In [39]:
runSELECT("select * from v5_emplocation")

       lastname firstname  location
0       Bacchan   Amitabh  Calcutta
1     Mukherjee      Rani    Bombay
2       Dikshit   Madhuri  Calcutta
3          Khan   Farookh  Calcutta
4        Sehwag  Virender  Calcutta
5         Dhoni  Mahender    Bombay
6        Dravid     Rahul  Calcutta
7        Dalmia  Jagmohan  Calcutta
8       Ganguly    Sourav    Bombay
9       Ganesan     Rekha  Calcutta
10  Karthikeyan   Narayan  Calcutta
11        Mirza     Sania  Calcutta

#Update base Table

In [27]:
runCMD("update empl set firstname = 'Shahrookh' where empid = '239456'")

1

In [28]:
runSELECT("select * from empl")

,empid,lastname,firstname,jobdesc,joindate,salary,comm,deptid
0,742866,Bacchan,Amitabh,Executive,2003-03-10,50000,0.10,10
1,349870,Mukherjee,Rani,Manager,2005-05-04,25000,0.06,40
2,865477,Dikshit,Madhuri,Clerk,2002-04-04,10000,0.02,20
3,239456,Khan,Shahrookh,Manager,2004-01-03,30000,0.07,20
4,897889,Sehwag,Virender,Cus_Rep,2005-01-02,15000,0.05,20
5,123980,Dhoni,Mahender,Clerk,2004-10-09,9000,0.02,40
6,822134,Dravid,Rahul,Sr Manager,2000-06-04,40000,0.08,30
7,997445,Dalmia,Jagmohan,Clerk,2001-07-01,12000,0.02,30
8,989007,Ganguly,Sourav,Cus_Rep,2002-01-01,20000,0.03,40
9,299034,Ganesan,Rekha,Director,2002-10-10,60000,0.11,10
10,546223,Karthikeyan,Narayan,Secretary,2005-12-04,40000,0.09,10
11,223112,Mirza,Sania,Cus_Rep,2001-11-19,25000,0.04,30

#Update a View

In [34]:
runCMD("update v3_dept30 set firstname = 'Farookh' where empid = '239456'")

1

#View - More Complex Views

In [40]:
runSELECT("SHOW FULL TABLES IN praxisDB WHERE TABLE_TYPE LIKE 'VIEW'")

  Tables_in_praxisDB Table_type
0             v1_emp       VIEW
1         v2_empclub       VIEW
2          v3_dept30       VIEW
3        v4_managers       VIEW
4     v5_emplocation       VIEW

In [41]:
#runCMD("drop view v6_DeptSalary")
runCMD("create view v6_DeptSalary as select deptid, sum(salary) deptSalary from empl group by deptid")

0

In [42]:
runSELECT("select * from v6_DeptSalary")

  deptid  deptSalary
0     10    150000.0
1     20     55000.0
2     30     77000.0
3     40     54000.0

In [43]:
# https://dev.mysql.com/doc/refman/8.0/en/view-updatability.html
runCMD("update v6_DeptSalary set deptSalary = 200000 where deptid = '10'")

OperationalError: ignored

In [44]:
runCMD("update v5_emplocation set firstname = 'Shahrukh' where firstname = 'Farookh'")

1

In [45]:
runCMD("update v5_emplocation set location = 'Kolkata' where firstname = 'Shahrukh'")

1

In [46]:
runSELECT("select * from dept")

  deptid    deptname managerid  location
0     10   Corporate    299034  Calcutta
1     20       Sales    239456   Kolkata
2     30    Accounts    822134  Calcutta
3     40  Production    349870    Bombay

#Chronobooks <br>
![alt text](https://1.bp.blogspot.com/-lTiYBkU2qbU/X1er__fvnkI/AAAAAAAAjtE/GhDR3OEGJr4NG43fZPodrQD5kbxtnKebgCLcBGAsYHQ/s600/Footer2020-600x200.png)<hr>
Chronotantra and Chronoyantra are two science fiction novels that explore the collapse of human civilisation on Earth and then its rebirth and reincarnation both on Earth as well as on the distant worlds of Mars, Titan and Enceladus. But is it the human civilisation that is being reborn? Or is it some other sentience that is revealing itself. 
If you have an interest in AI and found this material useful, you may consider buying these novels, in paperback or kindle, from [http://bit.ly/chronobooks](http://bit.ly/chronobooks)